{
	"feat": [{
			"name": "Dark Reaping",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Revenant"
				}]
			}],
			"ability": [{
				"cha": 1
			}],
			"entries": [
				"You have manifested a deeper connection to the Rift, which allows you to extract the thoughts of man and use it to fuel your abilities. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Additionally, when a creature within 30 feet of you is reduced to 0 hit points and dies, you can feed upon the power of their death to gain your choice of one of the following benefits:"
					]
				},
				{
					"type": "inset",
					"entries": [{
							"entries": [
								"• Temporary hit points equal to your total character level + your Constitution modifier, which last for up to one minute."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• The first attack you hit with on your next turn deals additional necrotic damage equal to your total character level + your choice of either your Strength or Charisma modifier."
							],
							"type": "entries"
						},
						{
							"entries": [
								"• Advantage on all saving throws until the start of your next turn."
							],
							"type": "entries"
						}
					],
					"data": {}
				},
				{
					"type": "list",
					"items": [
						"Once you use this ability, you must finish a short or long rest before you can use it again."
					]
				}
			]
		},
		{
			"name": "Sentient Bones",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "skeleton"
				}]
			}],
			"ability": [{
				"choose": {
					"from": [
						"dex",
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have become increasingly more self-aware as you time spent on the Material Plane increases. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Additionally, you can use a bonus action to detach or reattach one of your hands, which allows the hand to wander freely by walking on its fingertips. This deatched hand has a walking speed and climbing speed of 30 and can move up, down, and across vertical surfaces and upside down along ceilings.",
						"Your skeletal hand counts as an improvised weapon which you can use to make unarmed strikes. It has a thrown property of 15/30."
					]
				},
				{
					"type": "inset",
					"name": "",
					"entries": [{
							"entries": [
								"The hand has a strength score of 5, a hit point maximum equal to twice your total character level, and otherwise uses your statistics and AC. You cannot detach a hand in this way while using the Them Bones trait, or use Them Bones while a hand is detached."
							],
							"type": "entries"
						},
						{
							"entries": [
								"You have a psychic link with your detached hand, and can command it to move or take actions on your turn with no additional action from you. A hand detached in this way retains animation up to 1,000 feet away from you. A detached hand can take the Dodge, Disengage, Dash, or Help actions, but no other actions."
							],
							"type": "entries"
						},
						{
							"entries": [
								"You mentally receive visual and auditory information from the detached hand, which can see and hear as any other creature, in addition to having darkvision out to 30 feet. While the hand is detached, you know its exact location relative to you, as long as you are on the same plane of existence."
							],
							"type": "entries"
						}
					],
					"data": {
						"overwrite": "Sentient Hands"
					}
				}
			]
		},
		{
			"name": "Polearm Master",
			"source": "WB: RD",
			"entries": [
				"You can keep your enemies at bay with reach weapons. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you take the Attack action and attack with only a glaive, halberd, quarterstaff, two-handed scythe, pike, or spear, you can use a bonus action to make a melee attack with the opposite end of the weapon; this attack uses the same ability modifier as the primary attack. The weapon's damage die for this attack is a {@dice d4}, and the attack deals bludgeoning damage.",
						"While you are wielding a glaive, halberd, pike, quarterstaff, two-handed scythe, pike, or spear, other creatures provoke an opportunity attack from you when they enter your reach."
					]
				}
			]
		},
		{
			"name": "Punch King",
			"source": "WB: RD",
			"entries": [
				"Accustomed to the turbulent fighting that wielding two pairs of gauntlets bring, you casually strike across the battlefield with the force of a thousand suns. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While wielding a gauntlet in each hand, those gauntlets gain the unarmed keyword.",
						"When you hit a creature with a gauntlet attack on your turn, you can use a bonus action to attempt to grapple the target, instead of the normal action.",
						"When you use a gauntlet, its damage die changes from a {@dice d4} to a {@dice d6}.",
						"If you are currently grappling a target using your gauntlets, you can attempt to slam the enemy down and inflict brute force trauma upon them and their allies. You can forgo one of your attacks as part of the Attack action to slam your grappled target down on the ground, dealing {@dice 1d8} damage of the weapon's type for every 10 feet of movement you walk before making this special attack. In addition, all enemies within 5-feet of the target must make a Dexterity saving throw (DC: 8 + your proficiency bonus + your Strength modifier). On a failed save, those targets take {@dice 1d8} damage of the weapon's type.",
						"While moving with the intention to slam, your movement speed retains the halved negative, regardless of any modifiers you may have."
					]
				}
			]
		},
		{
			"name": "Blade Mastery",
			"source": "WB: RD",
			"prerequisite": [],
			"entries": [
				"You master the shortsword, longsword, scimitar, rapier, katana, sword cane, jian, khopesh, two-handed khopesh, odachi, and greatsword. You gain the following benefits when using them:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls you make with the weapon.",
						"As a bonus action, you may feint to try and lure a creature within reach of you into a disadvantageous position, potentially allowing you to strike the killing blow. The creature must succeed on a Wisdom saving throw with a DC equal to 8 + Proficiency Bonus + Strength or Dexterity modifier. On a failed save, the enemy falls for your ruse, granting you advantage on your next attack roll against them.",
						"As a reaction to when you are struck by a melee attack, you may try to parry the blow with your expert technique as long as it is not a critical hit. Make an attack roll with your currently wielded weapon, treating the enemy's attack roll as the target AC. On a successful hit, you parry the strike, negating it entirely. You may use this reaction a number of times equal to your proficiency bonus, regaining all uses on a short or long rest."
					]
				}
			]
		},
		{
			"name": "Dart in the Shadow",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"dex": 1
			}],
			"entries": [
				"The blowgun has grown to be an extension of your own body. Slinking through brushes has become your second home. Any who dare to cross you will discover that your weapon does not suck—it blows:",
				{
					"type": "list",
					"items": [
						"You ignore the loading property of blowguns. In addition, you can apply poison to blowgun darts as a bonus action, rather than as an action.",
						"Whenever you take the Attack action to make a ranged attack with a blowgun, you can make another attack with the same blowgun as a part of that Attack action. You can only make this special attack once per turn (regardless of whether you have extra attack or not).",
						"When you successfully take the {@action Hide} action, you do not give away your position when making an attack with a blowgun, regardless of whether or not the attack hits. Instead, you enter a state known as Limited Stealth."
					]
				},
				{
					"type": "inset",
					"name": "",
					"entries": [{
							"entries": [
								"{@b Limited Stealth.} While in Limited Stealth, you remain under the boons of &quot;Unseen Attackers and Targets&quot; as normal. However, creatures that are within 20 feet of you are alerted to your presence, and a creature stepping into a 20-foot radius of you causes you to be revealed to them.",
								"Limited Stealth ends when you make an attack with a weapon other than a blowgun, break your Hiding state through other means (such as casting a spell with a verbal component), or when you take the Hide action again."
							],
							"type": "entries"
						}
					],
					"data": {
						"overwrite": "Limited Stealth"
					}
				}
			]
		},
		{
			"name": "Fell Handed",
			"source": "OSoW",
			"prerequisite": [],
			"entries": [
				"You master the handaxe, battleaxe, greataxe, warhammer, and maul. You gain the following benefits when using any of them:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls you make with the weapon.",
						"Whenever you have advantage on a melee attack roll you make with the weapon and hit, you can knock the target prone if they are one size larger or smaller, if the lower of the two d20 rolls would also hit the target.",
						"Whenever you have disadvantage on a melee attack roll you make with the weapon, the target takes bludgeoning damage equal to your Strength modifier (minimum of 0) if the attack misses but the higher of the two d20 rolls would have hit."
					]
				}
			]
		},
		{
			"name": "Arbalester",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency in crossbows"
			}],
			"entries": [
				"Arbalesters began with the guided arrow technology that was invented by the United Cities of Imperium. The technology involves firing guided arrows that can be manipulated to attack multiple enemies. As an Arbalester, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you take the Attack action against a creature on your turn, you can transition your attack into a Guided Attack. You can only use an effect of Arbalester once per turn. If your target would be forced to make a saving throw, the DC is equal to 8 + your proficiency bonus + your Dexterity modifier. You can use a number of Guided Attacks equal to your Dexterity modifier, and regain all uses on a short or long rest.",
						{
							"type": "inset",
							"name": "",
							"entries": [{
									"entries": [
										"{@b Fanwise Shots.} Instead of firing one crossbow bolt, you shoot a series of five bolts in a fan shape. Creatures of your choice within a 20-foot cone must make a Dexterity saving throw. On a failed save, each of those creatures take damage equal to the normal damage of your weapon (1d6, 1d8, or 1d10) + your Dexterity modifier, or half as much damage on a successful save."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Dark Judgement.} You fire one bolt at a target creature within range. On a hit, you deal damage as normal and mark them with a Dark Target, highlighting their vulnerabilities with necromancy. Until the start of your next turn, attacks against that creature from creatures other than yourself deal an additional {@dice 1d4} necrotic damage."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Shining Burst.} You spin around with great finesse, firing bolts in a radius around yourself. Creatures of your choice within 20 feet must succeed on a Constitution saving throw or have one of their limbs crippled by your barrage of bolts on a failed save. A crippled creature has their movement speed reduced by half until the end of their next turn."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Guided Attack"
							}
				}
					]
				}
			]
		},
		{
			"name": "Quarrel Shooter",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency in crossbows"
			}],
			"entries": [
				"Archery involves a lot of maintenance work, but this is especially true for the Magic Kingdom of Aiara's quarrel shooters, who must take the maintenance of both their crossbow and their shield. Quarrel shooters are employed to defend against long-range attacks using their pavises, digging them in the ground to protect a point. As a quarrel shooter, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While you are using a light, heavy, or compound crossbow, you can use a bonus action to dig a shield you have stowed or equipped (known as a pavise) into the ground in front of you. While you are within the same square as your pavise, you gain the benefits of half cover, but your movement speed becomes 0. You maintain the use of both of your hands for the purposes of wielding two-handed crossbows. You can lift the shield back up and stow or equip it as a bonus action.",
						"When a creature enters a radius within 5 feet of you while your pavise in your square and attempts to target you for an Attack, you can use a reaction to kick up your shield and shove them back. That creature must succeed on a Strength saving throw with a DC equal to 8 + your proficiency bonus + your Dexterity modifier. On a failed save, that creature is knocked back 10 feet and you can immediately make one attack roll at them with your crossbow."
					]
				}
			]
		},
		{
			"name": "Wolf & the Fletcher",
			"source": "WB: RD",
			"ability": [
				{
					"choose": {
						"from": [
							"int",
							"wis"
						],
						"amount": 1,
						"entry": "Increase the chosen ability score by 1, to a maximum of 20."
					}
				}
			],
			"prerequisite": [{
				"other": "Proficiency in a ranged weapon"
			}],
			"entries": [
				"The Sentinels are an independent organization, separate from the law or jurisdiction of any kingdom. They are a band of independent experts, offering tutelage in their diverse professional fields. And of course, some of that knowledge has made its way to you. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can take the Search action as a bonus action, rather than as an action. In addition, whenever you take the Search action, you gain a +5 bonus to your roll. You can only take the Search action once per turn, regardless of how many actions you have left.",
						"As a bonus action while you are holding a ranged weapon, you can fire out a grappling hook from the underside of your wrist at a target point within 30 feet. You can then choose to begin reeling yourself to that point, expending your movement as normal. When you reach your destination, you hang from the point you are suspended as if you were climbing, and can fire two-handed ranged weapons without incurring penalty. As a free action, you can free your grapple hook and immediately begin climbing."
					]
				}
			]
		},
		{
			"name": "Sun & Moon",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with hook swords"
			}],
			"entries": [
				"Also known as &quot;Tiger Hook Swords&quot;, these blades excel at taking advantage of their hooked tips to manipulate enemies or to even manipulate their own reach to better assail foes with their intense combat style. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you grapple a creature with a hook sword, you can make and maintain the grapple with an Acrobatics check rather than a Dexterity check.",
						"When you hit a creature with an attack on your turn, you can choose to hook an enemy's leg with the tip of your weapon. The target must make a Strength saving throw (DC equal to 8 + your Proficiency bonus + your Dexterity modifier). On a failed save, they fall prone. You can use this effect once per turn and if the target does not have legs, this is ineffective.",
						"When you take the Attack action on your turn and are wielding two hook swords, you can hook the tips together to extend your reach. When you attack this way, your reach extends by 5 feet and you can also no longer knock enemies prone with the previous feature while attacking this way.",
						"While attacking this way, you can forgo one of your attacks via the Attack action to make a special attack against a target within your reach and attack any enemies directly to its left or right. On a hit, those creatures take {@dice 1d6} slashing damage. You cannot grapple an enemy with a hook sword while attacking in this way."
					]
				}
			]
		},
		{
			"name": "Akimbo Master",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency in a firearm"
			}],
			"entries": [
				"You master the art of wielding two ranged weapons at once. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can draw or holster two sidearms when you would normally be able to draw or holster only one.",
						"If you are wielding two ranged weapons with the reload property, you can ignore the reload property for those weapons, and do not need a free hand to reload them. This does not work on weapons with a reload property of 1.",
						"You can wield two one-handed ranged weapons at once, even if they do not have the light property. In addition, You can use two-weapon fighting with one-handed ranged weapons.",
						"Whenever you engage in two-weapon fighting using ranged weapons, when you make an extra attack with your bonus action, you can add your ability modifier to the damage of the second attack."
					]
				}
			]
		},
		{
			"name": "Front Line Infantry",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency in a firearm"
			}],
			"entries": [
				"You master the unique recoil and firing mechanism of automatic weapons. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You decrease the misfire score of any weapon with the automatic weapon property by 1.",
						"You can reload any weapon with the automatic weapon property as a bonus action, instead of an attack action.",
						"Whenever you attack a creature in combat that you have not attacked previously, you take them by surprise with the violent burst of your automatic weapon. Your first attack deals an extra {@dice 1d4} piercing damage.",
						"<u>Rapid Fire:</u> When you make a special attack against a target creature in range, you can expend up to four ammunition for a total of {@dice 4d6} piercing damage.",
						"<u>Automatic Fire:</u> When you make a special attack against creatures in a cone in front of you, you use the weapon's short range to determine the size of the cone, rather than half the short range."
					]
				}
			]
		},
		{
			"name": "Six-Gun Ace",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with revolvers"
			}],
			"entries": [
				"You have perfected the art of shooting with your revolver. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls with the revolver.",
						"You cannot be disarmed while wielding a revolver in one hand if your other hand is free.",
						"When you make an attack with your revolver and are not holding anything in your other hand, you can use your bonus action to make two additional attacks against creatures within its normal range. You do not add your ability score modifier to the damage of these attacks, unless that modifier is negative. You can use this feature a number of times equal to your Dexterity modifier (minimum 1), and you regain all expended charges on a long rest."
					]
				}
			]
		},
		{
			"name": "Deadeye",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with rifles, muskets, longarms, winchesters, or arquebus"
			}],
			"entries": [
				"Rifles are complex weapons, but you know just how to make every shot count. You gain the following benefits when wielding a non-assault rifle, musket, longarm, winchester, or arquebus:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls you make with these weapons.",
						"You can reroll any 1s to damage die with these weapons.",
						"If you roll a critical hit or deal a killing blow with these weapons, your shot pierces the target and strikes a creature within a 10-foot line behind it. If the original roll would hit the creature, it deals the damage (applied by the weapon) of the original roll. Otherwise, the bullet misses."
					]
				}
			]
		},
		{
			"name": "Distant Operator",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with rifles, muskets, longarms, winchesters, or arquebus"
			}],
			"entries": [
				"Rifles are complex weapons, but you've mastered the art of aiming them long distances. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While peering through the scope of a non-assault rifle, musket, longarm, winchester, or arquebus, you can make out details of even extremely distant creatures and objects as small as 2 feet across. In addition, attacking at long range doesn't impose disadvantage on ranged weapon attacks you make with a rifle or musket.",
						"If you are wielding a non-assault rifle, musket, longarm, winchester, or arquebus while you are {@condition prone}, you do not have disadvantage on attack rolls. In addition, you can use a bonus action to instill yourself with the confidence of a sniper. Starting at the beginning of your next turn and ending at the end of your next turn, you can treat an attack roll of 9 or lower with any of those weapons as a 10. You can use this feature a number of times equal to your proficiency bonus, and regain all expended uses on a long rest. You must be {@condition prone} to gain the benefits of these features."
					]
				}
			]
		},
		{
			"name": "Peltast",
			"source": "WB: RD",
			"prerequisite": [],
			"entries": [
				"You’ve mastered the ability to draw and throw weapons at your foes. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +2 to damage rolls with thrown weapons.",
						"Attacking at long range with your thrown weapons no longer imposes disadvantage.",
						"Being within 5 feet of a hostile creature doesn't impose disadvantage on ranged attack rolls.",
						"Whenever you take the Attack action to make a ranged attack with a thrown weapon, you can make one extra attack as a part of that Attack action. You can only make this special attack once per turn (regardless of whether you have extra attack or not). In addition, the weapon you are throwing has the light property, you increase its short and long range by 10 feet."
					]
				}
			]
		},
		{
			"name": "Master Duelist",
			"source": "WB: RD",
			"prerequisite": [],
			"entries": [
				"Whether you’ve studied under the masters of old, taught yourself through rigorous study and practice, or developed your own techniques, you’ve developed a beautiful and refined fighting style which grants you the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn one flourish of your choice from among those available to the Fencer archetype in the fighter class at level 3. If a flourish requires your target to make a saving throw to resist the flourish’s effects, the saving throw DC equals 8 + proficiency bonus + your Charisma modifier. You must follow the prerequisites outlined in the Fencer archetype to perform flourishes and use your precision die. Should you already know all the flourishes available at level 3, you may choose one skill or tool proficiency to learn instead.",
						"You gain one precision die, which is a d8 (this die is added to any precision die you have from another source). This die is used to fuel your flourishes. A precision die is expended when you use it. You regain precision die when you finish a short or long rest."
					]
				}
			]
		},
		{
			"name": "Quickhatch",
			"source": "WB: RD",
			"entries": [
				"You master the claws, a weapon which fit to your hands like it was meant to be there. As you trained with their steel, they have become an extension of yourself. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While you are wielding a pair of claws in each hand, creatures have disadvantage on opportunity attacks against you.",
						"When you use a claw, you can choose for its damage die to change from a {@dice d6} to a {@dice d8}. If you do so, that claw loses the light property.",
						"You can forgo one of your attacks as part of the Attack action to leap into the air, diving with the force of a wolverine as your claws lash out in a seismic whirlwind. You jump to a creature within 30 feet without expending any movement and make a special attack with your claws. On a hit, you deal {@dice 4d6} + your Strength or Dexterity modifier (your choice) slashing damage. Once you use this feature, you cannot use it again until you finish a short or long rest."
					]
				}
			]
		},
		{
			"name": "Dual Wielder",
			"source": "WB: RD",
			"entries": [
				"You master fighting with two weapons, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to AC while you are wielding a separate melee weapon in each hand.",
						"You can use two-weapon fighting even when the one-handed melee weapons you are wielding aren't light.",
						"You can draw or stow two one-handed weapons when you would normally be able to draw or stow only one.",
						"Additionally, whenever you engage in two-weapon fighting with melee weapons, you can make one extra attack as a part of that Attack action instead of using your bonus action. You cannot make an additional thrown weapon attack this way. This feature only takes effect on an Attack action. Additional attacks granted through Extra Attack (or similar features) count as one Attack action."
					]
				}
			]
		},
		{
			"name": "Flail Master",
			"source": "OSoW",
			"prerequisite": [],
			"entries": [
				"You’ve mastered the ability to sweep and swing flails at your foes. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls you make with a flail.",
						"As a bonus action on your turn, you can prepare yourself to extend your weapon to sweep over targets' shields. Until the end of this turn, your attack rolls with the weapon gain a +2 bonus against any target using a shield.",
						"When you hit with an opportunity attack using a flail, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + your Strength modifier) or be knocked prone."
					]
				}
			]
		},
		{
			"name": "Grappler",
			"source": "WB: RD",
			"prerequisite": [],
			"entries": [
				"You've developed the skills necessary to hold your own in close-quarters grappling. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While you are grappling only one creature, your speed is not halved.",
						"You have advantage on attack rolls against a creature you are grappling.",
						"You can use your action to try to pin a creature {@condition grappled} by you. To do so, make another grapple check. If you succeed, the creature is {@condition restrained} until the grapple ends."
					]
				}
			]
		},
		{
			"name": "Mariner",
			"source": "OSoW",
			"prerequisite": [],
			"entries": [
				"You have spent time at sea and learned to use the tools of a mariner in combat.",
				{
					"type": "list",
					"items": [
						"You gain an innate swimming speed of 30 feet. If you already have a swimming speed, it instead increases by 15.",
						"When you wield a trident with one hand, its damage die changes to 1d8 from 1d6. When you wield a trident with two hands, its damage die changes to 1d10 from 1d8.",
						"Tridents have the reach property. When you strike a creature with a Trident you may expend a bonus action to force a creature to make a contested {@skill Athletics} check with you. On a success you may force the creature to move into any unoccupied space within five feet of you."
					]
				}
			]
		},
		{
			"name": "Born in the Arena",
			"source": "OSoW",
			"prerequisite": [],
			"entries": [
				"Extensive training with nets has earned you the following benefits:",
				{
					"type": "list",
					"items": [
						"You don't suffer disadvantage when attack a creature within 5 feet of you with a net, or when throwing a net up to its long range.",
						"You can add your proficiency bonus to the DC, AC, and damage requirement for escaping or destroying you nets.",
						"When you use the Attack action and attack with a net, you can use a bonus action to attack with a one-handed weapon you are holding.",
						"When a creature provokes an opportunity attack from you, you can use your reaction to make a ranged weapon attack against that creature with a net."
					]
				}
			]
		},
		{
			"name": "Sling Superiority",
			"source": "OSoW",
			"prerequisite": [],
			"entries": [
				"You are trained in their military methods and have mastered the use of slings in combat.",
				{
					"type": "list",
					"items": [
						"When you end your turn without moving, before your next turn when a creature within 30 feet of you moves, you can use your reaction to make a ranged weapon attack with a sling against that creature.",
						"Once per turn when you make a ranged weapon attack without disadvantage using a sling, you can make an additional ranged weapon attack with a sling against a different creature.",
						"The first time you score a critical hit with a sling against a creature on a turn, that creature has disadvantage on all attack rolls and ability checks it makes until the start of your next turn."
					]
				}
			]
		},
		{
			"name": "Spear Mastery",
			"source": "OSoW",
			"prerequisite": [],
			"entries": [
				"Though the spear is a simple weapon to learn, it rewards you for the time you have taken to master it. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Spears you use gain the Finesse property.",
						"When you use a spear, its damage die changes from a d6 to a d8, and from a d8 to a d10 when wielded with two hands. (This benefit has no effect if another feature has already improved the weapon's die.)",
						"You can set your spear to receive a charge. As a bonus action, choose a creature you can see that is at least 20 feet away from you. If that creature moves within your spear's reach on its next turn, you can make a melee attack against it with your spear as a reaction. If the attack hits, the target takes an extra 1d8 piercing damage, or an extra 1d10 piercing damage if you wield the spear with two hands. You can't use this ability if the creature used the Disengage action before moving.",
						"As a bonus action on your turn, you can increase your reach with a spear by 5 feet for the rest of your turn."
					]
				}
			]
		},
		{
			"name": "Lash Endowed",
			"source": "OSoW",
			"prerequisite": [],
			"entries": [
				"You have extensive training with whips and have learned a handful of tricks useful in combat. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you use a whip, its damage die increases from a d4 to a d6.",
						"Once per turn when you deal damage with a whip or weighted chain to a creature that is no more than one size larger than you, you can force that creature to make a Strength saving throw (DC 8 + your proficiency bonus + your choice of your Strength or Dexterity modifier). On a failure, you choose whether the creature drops one object of your choice that it’s holding, falls prone, or has its movement speed halved until the start of your next turn. When reducing its movement speed in this way, you also move proportionate to the creature.",
						"When you take the Attack action and attack with a one- handed weapon, you can use a bonus action to attack with a whip or weighted chain you are holding."
					]
				}
			]
		},
		{
			"name": "Exorcist",
			"source": "OSoW",
			"prerequisite": [],
			"ability": [
				{
					"choose": {
						"from": [
							"wis"
						],
						"amount": 1,
						"entry": "Increase the chosen ability score by 1, to a maximum of 20."
					}
				}
			],
			"entries": [
				"You have been taught secret techniques for the removal of possessing spirits. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can use your action to touch a creature within your reach and determine if the creature is possessed or under the effects of an enchantment spell. If so, you learn the type of spirit possessing the creature or the spell enchanting it.",
						"By presenting a holy symbol to a creature within 10 feet as an action, you can attempt an exorcism ritual. If the creature is possessed by a spirit, the possessing spirit must make a Wisdom saving throw, with a DC = 8 + your proficiency bonus + your Wisdom modifier. On a failure, the spirit is expelled, and it cannot enter that creature again for 24 hours. On a success, the creature is immune to exorcism attempts for 24 hours."
					]
				}
			]
		},
		{
			"name": "Master of None",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Must not be benefiting from the Jack of All Trades feature."
			}],
			"ability": [
				{
					"choose": {
						"from": [
							"str",
							"dex",
							"con",
							"int",
							"wis",
							"cha"
						],
						"amount": 1,
						"entry": "Increase the chosen ability score by 1, to a maximum of 20."
					}
				}
			],
			"entries": [
				"Whether it be through curiosity, natural talent, a blessing from above, you've found yourself to be decently skilled at a small range of skills that just seem to come naturally to you. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You may add half your proficiency bonus (rounded down) to any ability check you make of the increased ability score, as long as it doesn't already include your proficiency bonus."
					]
				}
			]
		},
		{
			"name": "Otherworldly",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "ghost",
					"subrace": "spirit"
				}]
			}],
			"entries": [
				"Your soul has grown exceptionally powerful, and you may channel its energy into a semblance of mortal magic. You can cast the following spells with this feature: {@spell blink}, {@spell catapult}, and {@spell invisibility}.",
				{
					"type": "list",
					"items": [
						"When you cast {@spell invisibility} this way, you can only target yourself.",
						"Any spell cast using this feat is automatically cast at its lowest possible level, unless stated otherwise.",
						"Choose between Wisdom or Charisma; this is your spellcasting ability for these spells.",
						"At 4th level, {@spell catapult} casts at 2nd level. It becomes 3rd level at 8th, 4th level at 12th, 5th level at 16th, and 6th level at 20th.",
						"You can cast each spell granted by this feature once, and cannot cast it again until you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Undying Grasp",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "ghost",
					"subrace": "soulkin"
				}]
			}],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"Your life has bonded with the sarcophagus, turning both aspects into an extension of your will. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you hit with your Grasp from Beyond, you can force the creature to make a Constitution saving throw (DC: 10 + your Proficiency bonus + your Strength or Dexterity modifier).",
						"On a failed save, the creature becomes {@condition Paralyzed}.",
						"You can use this ability twice, after which you must spend a long rest before you can use Undying Grasp again."
					]
				}
			]
		},
		{
			"name": "Might of the Small",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Creature size of small"
			}],
			"ability": [{
				"str": 1
			}],
			"entries": [
				"You have an unusually strong carrying capacity and grip for a creature of your size, honed through years of constant training with heavy weapons. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Being Small doesn’t impose disadvantage on your attack rolls with heavy weapons.",
						"Your Strength score is doubled for the purpose of determining your carrying capacity and the weight you can push, drag, or lift.",
						"You can now grapple creatures up to two Sizes larger than you."
					]
				}
			]
		},
		{
			"name": "Black Lotus",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency in Poisoner's Kit"
			}],
			"entries": [
				"You have extensive experience dealing with poisons. Your mastery earns you the following benefits:",
				{
					"type": "list",
					"items": [
						"You have resistance to poison damage, and gain advantage on saving throws to avoid being poisoned.",
						"In addition, when you take a long rest, you fill three vials with one of the following poisons using your Poisoner's Kit (or one vial on a short rest):"
					]
				},
				{
					"type": "inset",
					"entries": [{
							"entries": [
								"{@b Powderboil.} This powdered poison can be applied to a weapon as an object interaction. The next time the weapon deals damage to a creature, it must succeed on a Constitution saving throw or take poison damage. The poison's damage is equal to xd8, where x equals half of your current level."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Stomachturner.} This slick oil can be applied to a weapon as an object interaction. The next time the weapon deals damage, the opposing creature becomes {@condition poisoned} for one minute, or until they spend an action on their turn to regain their senses."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Night's Kiss.} This tasteless and odorless liquid can be slipped into drink or food. When a creature consumes the poison, it must make a Constitution saving throw or fall unconscious for ten minutes. This effect ends if the creature takes damage."
							],
							"type": "entries"
						}
					],
					"data": {}
				},
				{
					"type": "list",
					"items": [
						"Poisons created in this way lose their potency, and expire at the completion of your next long rest.",
						"The DC for all saving throws for poisons created with this feat is 8 + your proficiency bonus + your Intelligence or Wisdom modifier (your choice)."
					]
				}
			]
		},
		{
			"name": "Close-Range Expert",
			"source": "WB: RD",
			"entries": [
				"Thanks to extensive practice mastering the act of close-quarters shooting, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You ignore the loading quality of crossbows with which you are proficient.",
						"Being within 5 feet of a hostile creature doesn't impose disadvantage on your ranged attack rolls.",
						"When you use the Attack action and attack with a one-handed weapon, you can use a bonus action to attack with a light ranged weapon you are holding."
					]
				}
			]
		},
		{
			"name": "Great Weapon Master",
			"source": "WB: RD",
			"entries": [
				"You've learned to put the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Whenever you attack with a heavy weapon that you are proficient with, you can make one extra attack as a part of that Attack action. This feature only takes effect on an Attack action. Additional attacks granted through Extra Attack (or similar features) count as one Attack action.",
						"Before you make a melee attack with a heavy weapon that you are proficient with, you can choose to take a penalty equal to your proficiency to the attack roll. If the attack hits, add double your proficiency to the damage roll."
					]
				}
			]
		},
		{
			"name": "Sharpshooter",
			"source": "WB: RD",
			"entries": [
				"You have mastered ranged weapons and can make shots that others find impossible. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.",
						"Your ranged weapon attacks ignore half cover and three-quarters cover.",
						"Before you make an attack with a ranged weapon that you are proficient with (other than blowguns), you can choose to take a penalty equal to your proficiency to the attack roll. If the attack hits, add double your proficiency to the damage roll."
					]
				}
			]
		},
		{
			"name": "Mage Slayer",
			"source": "WB: RD",
			"entries": [
				"You have practiced techniques useful in melee combat against spellcasters, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"When a creature within 5 feet of you casts a spell, you can use your reaction to make a melee weapon attack against that creature. When you make this reaction, you can choose to make the attack {@italic before} the spell is cast. If you use your reaction this way, you can only do so a number of times equal to your proficiency bonus, and regain all expended uses on a long rest.",
						"When you use your reaction to make a melee weapon attack against a creature while they are casting a spell and before the effects of the spell take place, that creature must make a concentration check. If that creature's concentration is broken, the spell fails.",
						"When you damage a creature that is concentrating on a spell, that creature has disadvantage on the saving throw it makes to maintain its concentration.",
						"You have advantage on saving throws against spells cast by creatures within 5 feet of you."
					]
				}
			]
		},
		{
			"name": "Aposematism",
			"source": "OSoW",
			"prerequisite": [{
				"race": [{
					"name": "Grung"
				}]
			}],
			"entries": [
				"You are a particularly dangerous Grung who has mastered the inherent properties of their body. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Your poison DC for your Poisonous Skin improves to 8 + your Constitution modifier + your proficiency bonus.",
						"As an action, you may cause the spots on your body to change color to a bright warning of danger. Creatures of your choosing within 10 feet must make a Wisdom saving through against your poison DC or become {@condition Frightened} for one minute. A creatures may repeat this saving throw at the end of each of their turn, ending the effect on a success. Creatures are no longer frightened once you leave their line of sight.",
						"Your walking and climbing speed increase by 5 feet.",
						"Your Standing Leap improves, increasing your long jump up to 30 feet and your high jump up to 20 feet."
					]
				}
			]
		},
		{
			"name": "Divebomber",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Aarakocra (Revised), Toran"
				}]
			}],
			"ability": [{
				"dex": 1
			}],
			"entries": [
				"You have mastered the art of in-flight combat, and can navigate the winds of battle with ease. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"While in the air, if you fly at least 30 feet straight toward a target and then hit it with a melee weapon attack on the same turn, you can immediately follow that attack with a bonus action, making one attack against the target with your talons."
					]
				}
			]
		},
		{
			"name": "Arcane Plagiarist",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Kenku"
				}]
			}],
			"ability": [{
				"int": 1
			}],
			"entries": [
				"You have learned to mimic the abilities of others, including the arcane. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you see a creature within 30 feet cast a spell, you can make an Intelligence check equal to 10 + the spell's level. On a success, you pull out a piece of parchment and copy down the spell's casting procedures, material components, and effects."
					]
				},
				{
					"type": "inset",
					"entries": [{
							"entries": [
								"This parchment can be copied down into a spellbook as a spell scroll could, with the effects equivalent to the spell you witnessed. However, this parchment can not be used as a spell scroll could, as it makes the magic foundation that would allow a spell to be cast."
							],
							"type": "entries"
						},
						{
							"entries": [
								"This scroll lasts for one week, and afterwards, the magic stealing properties of your mimicry fade, turning the runic markings that would allow you to copy the spell into a spellbook turn to gibberish."
							],
							"type": "entries"
						}
					],
					"data": {}
				},
				{
					"type": "list",
					"items": [
						"Once you use this ability, you must finish a long rest before you can use it again."
					]
				}
			]
		},
		{
			"name": "Blood of the Steeled Heart",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Lizardfolk"
				}]
			}],
			"ability": [{
				"con": 1
			}],
			"entries": [
				"Your years surviving the brutish treatment of you and your people has steeled your resolve to push forward, to break racial boundaries and grant yourself impressive resistance to even the most punishing of events. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You have advantage on saving throws that would cause you to be {@condition frightened}.",
						"You can use your Hungry Jaws trait a number of times equal to your Constitution modifer, rather than once every short or long rest."
					]
				}
			]
		},
		{
			"name": "Mind Breaker",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Aftuan"
				}]
			}],
			"entries": [
				"Your mental trespassing scars your victim's minds, and the wound left behind is easily recognizable for those who know where to look. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You are aware of all creatures within 30 feet who have been affected by a 1st level or higher enchantment spell you've cast.",
						"When the effects of a 1st level or higher enchantment spell with a duration of 1 minute or longer ends on a creature, it takes psychic damage equal to the spell's level + your Intelligence or Charisma modifier. You can optionally choose not to deal this additional damage.",
						"When all creatures you target with an enchantment spell succeed on its saving throw, and the spell itself has no effect on the targeted creatures, you do not expend the spell slot used to cast the spell. Once you use this feature, you must complete a short or long rest before you can use it again."
					]
				}
			]
		},
		{
			"name": "Active Computational Adjustment",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Nasod (Soldier), Nasod (Undercity Operative), Nasod (Magi)"
				}]
			}],
			"ability": [{
				"int": 1
			}],
			"entries": [
				"After being created by the Foundary, you found that you were installed with a special computational component that predicts your enemy's moves and causes your body to automatically respond. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you would make a Dexterity saving throw, you can instead make an Intelligence saving throw. You can use this feature a number of times equal to your Intelligence modifier, and you regain all expended uses on a long rest."
					]
				}
			]
		},
		{
			"name": "Diehard",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Demibeast (Leonin), Demibeast (Ursus), Demibeast (Wolf)"
				}]
			}],
			"ability": [{
				"con": 1
			}],
			"entries": [
				"A growl in the night, pained and furious. Knives and blades may slow you, but your resolve holds stronger. As a demibeast, it's never quite you time. You refuse to die. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you roll a death saving throw, you crit on a roll of 19 or 20.",
						"When you are reduced to 0 hit points, you can immediately move up to half your movement speed in any direction. This movement does not provoke attacks of opportunity."
					]
				}
			]
		},
		{
			"name": "Fanatical Devotion",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Kuo-Toa"
				}]
			}],
			"ability": [
				{
					"choose": {
						"from": [
							"int",
							"wis",
							"cha"
						],
						"amount": 1,
						"entry": "Increase the chosen ability score by 1, to a maximum of 20."
					}
				}
			],
			"entries": [
				"Your intense worship and piety grant you the following benefits:",
				{
					"type": "list",
					"items": [
						"When you create a kuo-toa idol using God Making, it remains for 8 hours instead of 1 hour, and is created with a number of temporary hit points equal to your level.",
						"While you are within 10 feet of your kuo-toa idol and can see it, you have advantage on all Intelligence, Wisdom, and Charisma saving throws, and can't be {@condition frightened} or {@condition charmed}."
					]
				}
			]
		},
		{
			"name": "Heavy Carapace",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Karkinos"
				}]
			}],
			"entries": [
				"Your carapace hardens and grows more dense, granting you the following benefits:",
				{
					"type": "list",
					"items": [
						"Your weight doubles. In addition, you shed into a larger, more sturdy shell. Your size increases from Medium to Large.",
						"When you aren’t wearing armor, your AC is 17 (your Dexterity modifier doesn’t affect this number). You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield’s benefits apply as normal while you use your natural armor.",
						"You have advantage on Strength checks and saving throws made against effects that would push you or knock you {@condition prone}.",
						"Your pincers gain the heavy property, and you can deal bludgeoning or slashing damage (your choice) equal to {@dice 1d8} + your Strength modifier when you hit with them."
					]
				}
			]
		},
		{
			"name": "Destined For Greatness",
			"source": "WB: RD",
			"entries": [
				"You have lived a life focused on a singular task, and as such, have mastered singular craft that you yourself hold dear. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency in a skill of your choice.",
						"You gain a +1 bonus to any ability check you make which apply your chosen skill's proficiency.",
						"The ability score most relevant to the skill increases by 1, to a maximum of 20."
					]
				}
			]
		},
		{
			"name": "Production Medic",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Nasod (Production)"
				}]
			}],
			"entries": [
				"Some Production Nasods were created to work on factory lines. Others were created to work on battlefields. As a Production Medic, you became incredibly proficient at keeping your fellow soldiers alive and defying the die of death. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Allies within 50 feet of you must fail an additional death saving throw to die.",
						"You can use a bonus action to move up to half your movement speed toward an unstable creature within your range of sight. This movement does not provoke attacks of opportunity.",
						"You automatically succeed on any Wisdom check made to stabilize a dying creature."
					]
				}
			]
		},
		{
			"name": "Artificer Initiate",
			"source": "WB: RD",
			"prerequisite": [],
			"entries": [
				"You’ve learned some of an artificer’s inventiveness, granting you the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn one cantrip of your choice from the artificer spell list, and you learn one 1st-level spell of your choice from that list. Intelligence is your spellcasting ability for these spells. Whenever you gain a level, you can replace one of these spells with another spell of the same level from the artificer spell list.",
						"You can cast this feat’s 1st-level spell without a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have.",
						"You gain proficiency with one type of artisan’s tools of your choice, and you can use that type of tool as a spellcasting focus for any spell you cast that uses Intelligence as its spellcasting ability."
					]
				}
			]
		},
		{
			"name": "Chef",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"Time and effort spent mastering the culinary arts has paid off. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency with cook’s utensils if you don’t already have it.",
						"As part of a short rest, you can cook special food, provided you have ingredients and cook’s utensils on hand. You can prepare enough of this food for a number of creatures equal to 4 + your proficiency bonus. At the end of the short rest, any creature who eats the food and spends one or more Hit Dice to regain hit points regains an extra {@dice 1d8} hit points.",
						"With one hour of work or when you finish a long rest, you can cook a number of treats equal to your proficiency bonus. These special treats last 8 hours after being made. A creature can use a bonus action to eat one of those treats to gain temporary hit points equal to double your proficiency bonus."
					]
				}
			]
		},
		{
			"name": "Crusher",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You are practiced in the art of crushing your enemies, granting you the following benefits:",
				{
					"type": "list",
					"items": [
						"Once per turn, when you hit a creature with an attack that deals bludgeoning damage, you can move it 5 feet to an unoccupied space, provided the target is no more than one size larger than you.",
						"When you score a critical hit that deals bludgeoning damage to a creature, attack rolls against that creature are made with advantage until the end of your next turn."
					]
				}
			]
		},
		{
			"name": "Eldritch Adept",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Spellcasting or Pact Magic feature"
			}],
			"entries": [
				"Studying occult lore, you have unlocked eldritch power within yourself: ",
				{
					"type": "list",
					"items": [
						"You learn one Eldritch Invocation option of your choice from the warlock class. If the invocation has a prerequisite, you can choose that invocation only if you’re a warlock and only if you meet the prerequisite.",
						"Whenever you gain a level, you can replace the invocation with another one from the warlock class."
					]
				}
			]
		},
		{
			"name": "Fey Touched",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"int",
						"wis",
						"cha"
					],
					"amount": 1
				}
			}],
			"entries": [
				"Your exposure to the Feywild or one of its denizens has left a magical mark on you. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn the {@spell misty step} spell and one 1st-level spell of your choice. The 1st-level spell must be from the divination or enchantment school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can’t cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells’ spellcasting ability is the ability increased by this feat."
					]
				}
			]
		},
		{
			"name": "Fighting Initiate",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with a martial weapon"
			}],
			"entries": [
				"Your martial training has helped you develop a particular style of fighting. As a result, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn one Fighting Style option of your choice from the fighter class. If you already have a style, the one you choose must be different.",
						"Whenever you gain a level, you can replace this feat’s fighting style with another one from the fighter class that you don’t have."
					]
				}
			]
		},
		{
			"name": "Metamagic Adept",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Spellcasting or Pact Magic feature"
			}],
			"entries": [
				"You’ve learned how to exert your will on your spells to alter how they function. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn two Metamagic options of your choice from the sorcerer class. You can use only one Metamagic option on a spell when you cast it, unless the option says otherwise. Whenever you gain a level, you can replace one of your Metamagic options with another one from the sorcerer class.",
						"You gain 2 sorcery points to spend on Metamagic (these points are added to any sorcery points you have from another source but can be used only on Metamagic). You regain all spent sorcery points when you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Piercer",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have achieved a penetrating precision in combat, granting you the following benefits:",
				{
					"type": "list",
					"items": [
						"Once per turn, when you hit a creature with an attack that deals piercing damage, you can reroll one of the attack’s damage dice, and you must use the new roll.",
						"When you score a critical hit that deals piercing damage to a creature, you can roll one additional damage die when determining the extra piercing damage the target takes."
					]
				}
			]
		},
		{
			"name": "Poisoner",
			"source": "WB: RD",
			"prerequisite": [],
			"entries": [
				"You can prepare and deliver deadly poisons, gaining the following benefits: ",
				{
					"type": "list",
					"items": [
						"When you make a damage roll, you ignore resistance to poison damage.",
						"You can coat a weapon in poison as a bonus action, instead of an action.",
						"You gain proficiency with the poisoner's kit if you don’t already have it.",
						"With one hour of work using a poisoner's kit and expending 40 Ethereum worth of materials, you can create a number of doses of potent poison equal to your proficiency bonus. One dose can be applied to one weapon or three pieces of ammunition as an action. Once applied, the poison retains potency for 1 minute or until you hit with the weapon. When a weapon coated in this poison deals damage to a creature, that creature must succeed on a Constitution saving throw with a DC equal to 8 + your proficiency bonus + your Intelligence or Wisdom modifier (your choice) or take {@dice 2d8} poison damage and become poisoned until the end of your next turn. "
					]
				}
			]
		},
		{
			"name": "Practiced Expert",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex",
						"con",
						"int",
						"wis",
						"cha"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have honed your proficiency with particular skills or tools, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency with one skill or tool of your choice.",
						"Choose one of your skill or tool proficiencies. Your proficiency bonus is doubled for any ability check you make that uses the chosen proficiency."
					]
				}
			]
		},
		{
			"name": "Shadow Touched",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"int",
						"wis",
						"cha"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You learn how to bend shadows from your experience with the Shadowfell. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn the {@spell darkness} spell and one 1st-level spell of your choice. The 1st-level spell must be from the illusion or necromancy school of magic. You can cast each of these spells without expending a spell slot. Once you cast either of these spells in this way, you can’t cast that spell in this way again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level. The spells’ spellcasting ability is the ability increased by this feat."
					]
				}
			]
		},
		{
			"name": "Shield Training",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex",
						"con"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You’ve trained in the effective use of shields. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain proficiency with shields.",
						"In combat, you can don or doff a shield as the free object interaction on your turn.",
						"If you have the Spellcasting or Pact Magic feature, you can use a shield as a spellcasting focus."
					]
				}
			]
		},
		{
			"name": "Slasher",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You’ve learned where to cut to have the greatest results, granting you the following benefits:",
				{
					"type": "list",
					"items": [
						"Once per turn when you hit a creature with an attack that deals slashing damage, you can reduce the speed of the target by 10 feet until the start of your next turn.",
						"When you score a critical hit that deals slashing damage to a creature, you grievously wound it. Until the start of your next turn, the target has disadvantage on all attack rolls."
					]
				}
			]
		},
		{
			"name": "Tandem Tactician",
			"source": "WB: RD",
			"prerequisite": [],
			"entries": [
				"Your presence in a scrap tends to elevate your comrades. You gain the following benefits: ",
				{
					"type": "list",
					"items": [
						"You can use the Help action as a bonus action.",
						"When you use the Help action to aid an ally in attacking a creature, increase the range of the Help action by 10 feet. Additionally, you can help two allies targeting the same creature within range when you use the Help action this way."
					]
				}
			]
		},
		{
			"name": "Tracker",
			"source": "WB: RD",
			"prerequisite": [],
			"ability": [{
				"choose": {
					"from": [
						"wis"
					],
					"amount": 1
				}
			}],
			"entries": [
				"You have spent time hunting creatures and honed your skills, gaining the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn the hunter’s mark spell. You can cast it once without expending a spell slot, and you must finish a long rest before you can cast it in this way again. You can also cast the spell using any spell slots you have. Wisdom is your spellcasting ability for this spell.",
						"You have advantage on Wisdom ({@skill Survival}) checks to track creatures."
					]
				}
			]
		},
		{
			"name": "Dangerous Profession",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Nasod (Production)"
				}]
			}],
			"entries": [
				"Working on the factory line has subjected you to numerous magical effects as you attempted to replicate their function in technological form. In such a magicless city, you had to learn to resist magical effects lest you succumb to wounds no medic could heal. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can add half your proficiency bonus to a saving throw made against a spell, if you do not already add your proficiency bonus."
					]
				}
			]
		},
		{
			"name": "Forgiveness",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Demibeast (Ursus), Half-Ogre, The Beneath, Warforged (Juggernaut), Pandarian (Banded)"
				}]
			}],
			"entries": [
				"Every part of your body has become a weapon, a fine-tuned instrument which you can utilize in brutal chokeholds the lowlanders often call hugs. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you add your proficiency bonus to an ability check made to grapple, you can instead add twice your proficiency bonus.",
						"While grappling a creature, you gain the benefits of half cover.",
						"As a bonus action while you are grappling a creature, you can crush them in your warm embrace, dealing damage equal to your Strength modifier.",
						"You cannot gain the benefit of any of these features using a weapon with the Grappling property."
					]
				}
			]
		},
		{
			"name": "Wild Talent",
			"source": "WB: RD",
			"ability": [
				{
				}
			],
			"entries": [
				"You awaken to your psionic potential, which enhances your mind or body. Increase one ability score of your choice by 1, to a maximum of 20, to represent this enhancement.",
				"You also harbor a wellspring of psionic power within yourself, an energy that ebbs and flows as you channel it in various ways. This power is represented by your Psionic Talent die, the starting size of which is a {@dice d6}.",
				{
					"type": "entries",
					"name": "Psionic Talent Options",
					"entries": [
						"You can use your Psionic Talent die in the following ways:",
						{
							"type": "list",
							"style": "list-hang-notitle",
							"items": [
								{
									"type": "item",
									"name": "Psi-Boosted Ability.",
									"entry": "When you make an ability check with the ability increased by this feat, you can roll your Psionic Talent die and add the number rolled to the check. You can choose to do so before or after rolling the {@dice d20}, but before you know whether the check succeeded or failed."
								},
								{
									"type": "item",
									"name": "Psi-Guided Strike.",
									"entry": "Once on each of your turns when you hit with an attack roll that uses the ability increased by this feat, you can roll your Psionic Talent die after you make the damage roll and then replace one of the damage dice with the number rolled on the Psionic Talent die."
								}
							]
						}
					]
				},
				{
					"type": "entries",
					"name": "Changing the Die's Size",
					"entries": [
						"If you roll the highest number on your Psionic Talent die, it decreases by one die size after the roll. This represents you burning through your psionic energy. For example, if the die is a {@dice d6} and you roll a 6, it becomes a {@dice d4}. If it's a {@dice d4} and you roll a 4, it becomes unusable until you finish a long rest.",
						"Conversely, if you roll a 1 on your Psionic Talent die, it increases by one die size after the roll, up to its starting size. This represents you conserving psionic energy for later use. For example, if you roll a 1 on a {@dice d4}, the die then becomes a {@dice d6}.",
						"Whenever you finish a long rest, your Psionic Talent die resets to its starting size. When you reach certain levels, the starting size of your Psionic Talent die increases: at 5th level ({@dice d8}), 11th level ({@dice d10}), and 17th level ({@dice d12}). If you have a Psionic Talent die from another source, such as a class feature, you don't get more than one die; use only the one with the largest starting size."
					]
				},
				{
					"type": "entries",
					"name": "Psi Replenishment",
					"entries": [
						"As a bonus action, you can calm your mind for a moment and restore your Psionic Talent die to its starting size. You then can't use Psi Replenishment again until you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Metabolic Control",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Psionic Talent feature or Wild Talent feat"
			}],
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex",
						"con"
					],
					"amount": 1
				}
			}],	
			"entries": [
				"You have refined psionic control over your body's functions. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can take an action to channel your psionic power to nourish yourself for the next 24 hours, as if you consumed sufficient food and water for a day.",
						"If your Psionic Talent die is available, you can meditate for 1 minute. At the end that minute, you can expend a number of hit die up to your current maximum and regain that many hit points. Finally, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to half your proficiency bonus (rounded down). Regardless of how many features of this ability you choose to use, your Psionic Talent die decreases by one die size. You can't meditate in this way again until you finish a long rest."
					]
				}
			]
		},
		{
			"name": "Tower of Iron Will",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Psionic Talent feature or Wild Talent feat"
			}],
			"entries": [
				"Your mind's defenses are formidable. After you or another creature you can see within 30 feet of you fails a saving throw, you can use your reaction to roll your Psionic Talent die and add the number rolled to the saving throw, potentially causing it to succeed."
			]
		},
		{
			"name": "Shurikenjutsu",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with shurikens"
			}],
			"entries": [
				"You have mastered the art of fighting with shuriken, be it from the shadows or as a supplementry weapon. While wielding shuriken, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you use shuriken, its damage die changes from a {@dice d4} to a {@dice d6}.",
						"When you take the Attack action against a creature on your turn, you can transition your attack into a Vital Attack. On a hit, the target takes damage from your shuriken and you choose one of the following effects to transpire. You can only use an effect of Shurikenjutsu once per turn. If your target would be forced to make a saving throw, the DC is equal to 8 + your proficiency bonus + your Dexterity modifier. You can use a number of Vital Attacks equal to your Dexterity modifier, and regain all uses on a short or long rest.",
						{
							"type": "inset",
							"name": "",
							"entries": [{
									"entries": [
										"{@b Cut the Skin.} The target must make a Constitution saving throw. On a failed save, that creature begins to bleed. That creature takes {@dice 1d8} necrotic damage at the end of each of its turns. The bleeding stops if the target uses an action, is healed by magic, takes a short or long rest, or has a successful Wisdom ({@skill Medicine}) check made on them by another creature (DC 12)."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Slice the Tendon.} The target must make a Constitution saving throw. On a failed save, that creature takes an additional {@dice 1d4} damage of your weapon's type and has their movement speed reduced by half. This reduced movement speed can only be applied once per target, and ends if the target uses an action, is healed by magic, takes a short or long rest, or has a successful Wisdom ({@skill Medicine}) check made on them by another creature (DC 12)."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Gouge the Eyes.} The target must make a Dexterity saving throw or become {@condition blinded}. At the start of each of their turns, they can remake the save, ending the effect on a success. The effect also ends if the creature uses an action, is healed by magic, takes a short or long rest, or has a successful Wisdom ({@skill Medicine}) check made on them by another creature (DC 12)."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Vital Attack"
							}
				},
						"If a target would be afflicted by multiple of your Vital Attacks at once, a separate Wisdom ({@skill Medicine}) check is needed to circumvent each ailment."
					]
				}
			]
		},
		{
			"name": "Dark One's Grit",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with daggers"
			}],
			"entries": [
				"Like a trained pitcher on base, you have learned to throw a variety of shadow-influenced fastballs utilizing throwing daggers as a conduit. Some are basic techniques—others are reality-bending vehicles to tool destruction upon your foes. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Whenever you attack with a dagger on your turn via throwing, you determine the trajectory of the dagger by choosing one Shadowmance from the list below.",
						{
							"type": "inset",
							"name": "",
							"entries": [{
									"entries": [
										"{@b Curved Executioner.} Your dagger arcs through the sky in a parabola, usurping all barriers. You ignore the benefits of half and three-quarters cover. You also ignore the effects of full cover if there is at least a 1-inch gap located anywhere on the obstacle."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Hadar's Shadow Gate.} You make your thrown weapon attack as if you were standing in any location that you can see within 20 feet of you, allowing your attack to originate from behind magical barriers and from unobservable positions. If you make this attack while no hostile creature is within 30 feet of you, you do not lose the benefits of &quot;Unseen Attackers and Targets&quot; (if you were Hiding)."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Bouncing Harbinger.} If you successfully hit your target with your attack, your dagger ricochets off that target. Target one creature or object within 15 feet. You make an attack roll against that target with the same weapon. Regardless of any special effect applied to the dagger, your damage roll equals 1d4 + your Dexterity modifier."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Shadowmance"
							}
				}
					]
				}
			]
		},
		{
			"name": "Called Shot",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with bows"
			}],
			"entries": [
				"Like a trained pitcher on base, you have learned to throw a variety of shadow-influenced fastballs utilizing throwing daggers as a conduit. Some are basic techniques—others are reality-bending vehicles to tool destruction upon your foes. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Whether it be through intense training or natural talent, your aim is truly impeccable. You've mastered the art of targeting specific areas of your enemies, strategically debilitating them until you can finally put an end to them.",
						"When you take the Attack action on your turn with a longbow, shortbow, or a compound bow, you may forgo one attack to make a Called Shot. Once you have declared a Called Shot, inform the DM where on your enemy you would like to strike. You may then make your attack roll with disadvantage.",
						"Upon a successful hit, add one additional damage die when calculating damage, and the creature is subject to the effect associated with the body part you chose to target:",
						{
							"type": "inset",
							"name": "",
							"entries": [{
									"entries": [
										"{@b Head.} The target has disadvantage on saving throws made to keep concentration on a spell, and cannot perform verbal components until the end of their next turn."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Arm.} The target drops their weapon in hand is unable to use that limb until the end of their next turn. "
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Leg.} The target has their movement speed halved until the end of their next turn."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Chest.} The target has disadvantage on attack rolls and ability checks until the end of their next turn."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Called Shots"
							}
				}
					]
				}
			]
		},
		{
			"name": "Jian Wu",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with jian"
			}],
			"entries": [
				"Folklore refers to the jian as the gentlemen of weapons, and you have embodied the beauty of its almost dance-like patterns. While wielding a jian, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you use a jian, its damage die changes from a {@dice d6} to a {@dice d8}, and from a {@dice d8} to {@dice d10} when utilizing its versatile property.",
						"When you take the Attack action on your turn, your movement speed increases by 10 feet until the end of your turn.",
						"You can forgo one of your attacks as part of your Attack action. When you do so, you can immediately move up to 10 feet in any direction without provoking opportunity attacks. You can only use this feature once per turn."
					]
				}
			]
		},
		{
			"name": "Beyond Tradition",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "The ability to cast at least one spell."
			}],
			"entries": [
				"They say spellcasters can't be fighters. While that idea is mostly a misconception, there are those who will always be uninformed. You hope that with this mastery, you'll be able to change the common connotation of your abilities. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn three separate {@italic strike} cantrips from the following list: {@spell buffering strike|WB: RD}, {@spell dazzling strike|WB: RD}, {@spell false strike|WB: RD}, {@spell haemorrhaging strike|WB: RD}, {@spell knowing strike|WB: RD}, {@spell phase strike|WB: RD}, {@spell shifting strike|WB: RD}, or {@spell sonic strike|WB: RD}.",
						"When you cast a {@italic strike} spell on your turn from the above list against a creature who is currently afflicted by the {@condition blinded}, {@condition charmed}, {@condition deafened}, {@dice frightened}, {@condition paralyzed}, {@condition poisoned}, or {@condition stunned} condition, you can deal an extra {@dice 3d6} force damage to that target. You can only gain the benefits of this feature once per turn."
					]
				}
			]
		},
		{
			"name": "Platform Shooter",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with pistols or sidearms"
			}],
			"entries": [
				"You have trained in a pistoleer style of shooting that focuses on the use of one pistol held in both hands for stability. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you draw a pistol or sidearm (such as a pistol, sidearm pistol, palm pistol, or weighted pistol), you can choose to enter a stance known as the Platform Stance. While in this stance, your firearm gains the two-handed property (if it did not have it already), and you gain a +1 bonus to attack and damage rolls. Also while in this stance, you can reload your firearm as a bonus action.",
						"While in the Platform Stance, you can make a special melee attack against a creature within 5 feet of you as an Attack action. This attack is considered an unarmed attack that you are proficient with the finesse property. On a hit, the target must make a Strength saving throw with a DC equal to 8 + your Proficiency Bonus + your Dexterity modifier or be knocked {@condition prone}. In addition to this, on a failed save, you immediately make one attack with your firearm against that creature."
					]
				}
			]
		},
		{
			"name": "Grand Chariot",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with great chakrams"
			}],
			"entries": [
				"The great chakram is a wheeled instrument of demonstrable force, proven by its hefty weight and near complete impraticality in combat. It was once used by the giants of old to rout the weakened lesser races from the fields of battle; a quirk that you, despite your size, have managed to take advantage of. While wielding the great chakram, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Attacking a {@condition prone} target from range with your great chakram no longer imposes disadvantage, and you instead gain advantage.",
						"You can forgo one of your attacks as part of your Attack action in order to perform a Grand Chariot with your chain. If your special attack requires a saving throw, its DC is equal to 8 + your proficiency bonus + your Strength modifier. Choose one of the following options to transpire:",
						{
							"type": "inset",
							"name": "",
							"entries": [{
									"entries": [
										"{@b Steel their Resolve.} You throw out your chain before your great chakram, capturing a creature within 30 feet. That creature must make a Dexterity saving throw. On a failed save, that creature becomes {@condition restrained} until the end of your current turn."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Star Fall.} You immediately throw out your great chakram, letting it fly through the air for a moment before lashing at it with your chain. You pull your chakram back before it hits any targets, subsequentially lurching it into the sky and slamming it down by the chain onto the battlefield moments later.",
										"Target a 10-foot radius within 30 feet of you. All creatures within that radius must make a Strength saving throw. On a failed save, those creature are knocked {@condition prone} and take {@dice 1d6} + your Strength modifier bludgeoning damage, or half as much damage on a successful save."
									],
									"type": "entries"
								},
								{
									"entries": [
										"{@b Destruction of Will.} You wrap your chain around your great chakram and unreel it at a target like a yoyo. Target one creature within 30 feet of you. That creature must succeed on a Strength saving throw or take {@dice 1d10} + your Strength modifier slashing damage be knocked back {@dice 1d4} x 10 feet, or half as much damage on a successful save."
									],
									"type": "entries"
								}
							],
							"data": {
								"overwrite": "Special Chariot"
							}
				},
						"You can use a number of Grand Chariots equal to your proficiency bonus, and regain all expended uses on a long rest."

					]
				}
			]
		},
		{
			"name": "Whirlwind of Fury",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with nunchaku"
			}],
			"entries": [
				"Be it sticks or metals, while they are attached via chain, they become deadly in the palms of your hand. In the dance of a martial artist, none can escape your whirlwind of fury. While wielding nunchaku, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a +1 bonus to attack rolls made with nunchaku.",
						"When a creature enters your reach, you can use a reaction to make an attack against them in an attempt to catch them unaware. If you hit, instead of dealing damage, that creature has disadvantage on attacks made against you until the end of their turn.",
						"Whenever you hit a creature with nunchaku on your turn, you can use a bonus action to attempt to distract them with a dazzling display of your skill. That creature must make a Charisma saving throw with a DC equal to 8 + your proficiency bonus + your Dexterity modifier. On a failed save, you gain advantage on your next attack against them, and that attack deals an additional {@dice 4d8} psychic damage. Once you use this feature, you cannot use it again until you finish a short or long rest."
					]
				}
			]
		},
		{
			"name": "Sanjigun Practitioner",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with three-section staves"
			}],
			"entries": [
				"Though complicated and requiring years of training, the three-section staff shines like an arc of destruction in the hands of a skilled practitioner. While wielding three-section staves, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When you use a three-section staff as a double weapon, its damage die changes from a {@dice d4} to a {@dice d6}.",
						"As a reaction to a creature targetting you for an attack, you swing your three-section staff around your form in an attempt to dissaude your assailant's aim. That attack has disadvantage against you, and if it misses, you can make an attack against that creature or another creature within range with your three-section staff as part of the same reaction.",
						"Once per turn when you take the Attack action against a creature, you can utilize your staff's interlocking pieces to extend your reach around an enemy's guard, potentially causing a missed attack to hit. You gain a bonus to your next attack roll equal to half your relevant attack modifier, rounded down. You can use this feature a number of times equal to your proficiency bonus, and regain all expended uses on a short or long rest."
					]
				}
			]
		},
		{
			"name": "Laido Practitioner",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency with odachi"
			}],
			"entries": [
				"With high-quality metal and a stern personality molded over the course of years, your skills with a blade have folded over as many times as the steel of your odachi. While you are wielding an odachi, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Odachis you wield gain the reach (10 ft.) property.",
						"When you take the Attack action on your turn, you can make one special melee attack as part of that attack action. You draw your wakizashi, run into range, and strike. This attack uses the same ability modifier as the primary attack, but the damage die for this attack is a d6, and the attack deals piercing damage. You can only make this special melee attack once per turn, regardless of how many Attack actions you may have. You do not move closer to or further away from the creature when you make this attack.",
						"When you take the Attack action on your turn, you can use a bonus action to reorient yourself with a strike, slashing through the enemy and appearing around their flank. You dash through the hostile creature's space, landing on an unoccupied space within 10 feet of them without provoking opportunity attacks."
					]
				}
			]
		},
		{
			"name": "Right Hand of Ra",
			"source": "WB: RD",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"amount": 1
				}
			}],	
			"prerequisite": [{
				"other": "Proficiency in one-handed khopesh"
			}],
			"entries": [
				"You have practiced extensively in the art of utilizing khopesh, mastering their unique curved forms and their hooked ends as an armor-breaking weapon. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You have adopted a certain level of dexterity when manipulating your khopesh. One-handed khopesh you use gain the finesse property.",
						"Your time spend fighting in crowded environments has honed the fluidity of your movement. As a bonus action, you can ignore the effects of difficult terrain until the start of your next turn. You can use this feature a number of times equal to your proficiency bonus, and regain all expended uses on a long rest.",
						"When you make an attack with a one-handed khopesh weapon against a creature with a shield, you can replace that attack with a special weapon attack that does not require an attack roll. The opposing creature must make a Dexterity saving throw with a DC equal to 8 + your proficiency bonus + your Strength or Dexterity modifier. On a failed save, that creature's shield is wrestled from their grip as the hook of your blade drags it onto the ground. The shield lands in an unoccupied space within 5 feet of the creature. You can only make this special attack once per turn."
					]
				}
			]
		},
		{
			"name": "Two-Handed Technique",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Cannot be used alongside the Dual Wielder feat."
			}],
			"entries": [
				"One-handing a weapon is a fool's errand. After all, the force behind your attacks increase with better leverage. Offense is the best defense. While wielding a weapon while utilizing its versatile property, you gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You gain a bonus to your damage rolls equal to half your proficiency bonus, rounded up.",
						"When you successfully hit a creature, you can make one extra attack as a part of that Attack action with the same weapon. You can only make this special attack once per turn (regardless of whether you have extra attack or not).",
						"As a reaction to being targeted for an attack by another creature, you increase your AC by half your proficiency bonus, rounded up. The creature then rolls. If the attack would miss, you can immediately make an attack with the pommel or hilt of your weapon as part of the same reaction. This attack uses your relevant attack modifier and deals 1d4 + your relevant damage modifier bludgeoning damage."
					]
				}
			]
		},
		{
			"name": "Telekinetic",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Psionic Talent feature or Wild Talent feat"
			}],
			"ability": [
				{
					"choose": {
						"from": [
							"int",
							"wis",
							"cha"
						],
						"amount": 1
					}
				}
			],
			"entries": [
				"You learn to move things with your mind. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You learn the {@spell mage hand} cantrip. You can cast it without verbal or somatic components, and you can make the spectral hand {@condition invisible}. If you already know this spell, its range increases by 30 feet when you cast it. Its spellcasting ability is the ability increased by this feat.",
						"As a bonus action, you can try to telekinetically shove one creature you can see within 30 feet of you. When you do so, the target must succeed on a Strength saving throw (DC 8 + your proficiency bonus + the ability modifier of the score increased by this feat) or be moved 5 feet toward you or away from you. A creature can willingly fail this save."
					]
				}
			]
		},
		{
			"name": "Telepathic",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Psionic Talent feature or Wild Talent feat"
			}],
			"ability": [
				{
					"choose": {
						"from": [
							"int",
							"wis",
							"cha"
						],
						"amount": 1
					}
				}
			],
			"entries": [
				"You awaken the ability to mentally connect with others. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can speak telepathically to any creature you can see within 30 feet of you. Your telepathic utterances are in a language you know, and the creature understands you only if it knows that language. Your communication doesn't give the creature the ability to respond to you telepathically.",
						"If your Psionic Talent die is available, you can cast the {@spell detect thoughts} spell, requiring no components. When you start casting the spell, your Psionic Talent die decreases by one die size. Your spellcasting ability for the spell is the ability increased by this feat."
					]
				}
			]
		},
		{
			"name": "Warder",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Cannot be used alongside the Mounted Combatant feat."
			}],
			"entries": [
				"You have trained a creature under to employ to protect and defend you with all its might. Once per long rest, you can designate a creature you control to be your Warder. While a creature is your Warder, they gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Your Warder shares the same initiative as you, even if it normally cannot.",
						"Your Warder gains an additional hit point maximum equal to 2 × your level.",
						"While your Warder is within 5-feet of you, it can force an attack targeting you to target itself instead. Your Warder can also make Strength, Constitution, and Dexterity saving throws for you. If the saving throw would target the both of you, you only roll once."
					]
				}
			]
		},
		{
			"name": "Choice of a Reaper",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Cannot be used alongside the Tune of a Reaper feat."
			}],
			"entries": [
				"A scythe is at its deadliest when its being used to its fullest extent. For you, this means utilizing it at its maximum range. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"When attacking at your maximum reach, your two-handed scythe deals {@dice 2d6} damage, rather than {@dice 2d4}.",
						"If you make an attack with your two-handed scythe using the Attack action, you can use a bonus action to turn it into a special weapon attack against a creature within 15 feet. This attack does not activate your scythe's special property. Instead, on a successful hit, you deal your scythe's normal damage and pull the creature into an unoccupied space 5 feet in your direction."
					]
				}
			]
		},
		{
			"name": "Tune of a Reaper",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Cannot be used alongside the Choice of a Reaper feat."
			}],
			"entries": [
				"Others treat scythes with the lumber of an oaf. You treat them as they were always meant to be—a fleeting weapon which spins around with the lightest of nudges. You attack like a dance, and your enemies become ravaged by the sight. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"The damage for the special property of your scythe increases to {@dice 1d6} (from {@dice 1d4}).",
						"When you take the Attack action on your turn while wielding a two-handed scythe, you can move 10 feet in any direction before making the attack. When you use this ability, you must move to a space within the creature's range.",
						"As a bonus action, you begin to hum a tune, spinning your scythe along to the rhythm. On your next successful hit with your two-handed scythe, you slash in beautiful yet deadly patterns, slicing-and-dicing through all creatures in your wake. You deal an additional {@dice 4d4} damage of your weapon's type, and all creatures within 5 feet of you other than the creature you targeted take {@dice 2d4} slashing damage. Once you use this ability, you cannot use it again until you finish a short or long rest."
					]
				}
			]
		},
		{
			"name": "Way of Worlds",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "An Attuned Flight feature (including variants such as Greater)."
			}],
			"entries": [
				"Flying is as easy as walking for you—and no, you don't mean that at the physical sense. You have metaphysically transcended the need to attune to the Way of Worlds. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Your Attuned Flight feature no longer requires attunement.",
						"When you leave a hostile creature's reach on your turn while flying, all opportunity attacks made against you are rolled at disadvantage."
					]
				}
			]
		},
		{
			"name": "Woke",
			"source": "WB: RD",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex"
					],
					"count": 1,
					"amount": 1
				}
			}],
			"prerequisite": [{
				"race": [{
					"name": "Awakened (All)"
				}]
			}],
			"entries": [
				"Your body has been completely transformed by the magic that gave you sentience. As a result of this, your form has adapted to a more humanoid shape, allowing you to accomplish more complex tasks than previously possible. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You can now pick up weapons and use them in combat, as well as handle larger complex tasks akin to the average humanoid race.",
						"You gain the ability to speak, read, and write in languages you understand, if you couldn't previously.",
						"Being Tiny doesn’t impose disadvantage on your attack rolls with heavy weapons."
					]
				}
			]
		},
		{
			"name": "Advanced Mutation",
			"source": "WB: RD",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex",
						"con",
						"int",
						"wis",
						"cha"
					],
					"count": 1,
					"amount": 1
				}
			}],
			"prerequisite": [{
				"race": [{
					"name": "Demihuman"
				}]
			}],
			"entries": [
				"You have mutated am additional trait, being among the few of your kind to exhibit more than a handful of biologicial boons from your ancestors. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You may choose an additional trait from the Birth of Creation list to evolve and benefit from."
					]
				}
			]
		},
		{
			"name": "Engulf",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Archslime"
				}]
			}],
			"entries": [
				"You have learned to use your ooze-like consistency in interesting and unique ways. While you are transformed into your lumpy amorphous form, you can forgo one of your attacks as part of your Attack action in order to perform a special contested grapple check against a creature within 10 feet of you.",
				"On a success, you lurch your body forwards and transform into mass of dripping ooze, coating their form and restricting them with your body. That creature becomes {@condition grappled} and begins suffocating. In addition, your target receives half of any damage dealt to you while in this state.",
				"A creature can break out of this grapple by making a successful Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier at the start of their turn. You can use this feature a number of times equal to your proficiency bonus, and regain all expended uses on a long rest."
			]
		},
		{
			"name": "Cybernetic Evolution",
			"source": "WB: RD",
			"ability": [{
				"choose": {
					"from": [
						"str",
						"dex",
						"con",
						"int",
						"wis",
						"cha"
					],
					"count": 1,
					"amount": 1
				}
			}],
			"prerequisite": [{
				"race": [{
					"name": "Half-Forged"
				}]
			}],
			"entries": [
				"You have resolved yourself to cybernetically augment your form further beyond than most others of your kind, embracing the superiority of steel over flesh. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"You may choose an additional Cybernetic Implant of your choice to augment yourself with from the Cybernetic Implants list."
					]
				}
			]
		},
		{
			"name": "Abyssal Centrifuge",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "Abyssborn"
				}]
			}],
			"entries": [
				"You have mastered the art of the scythe, an Abyssborn's most trusted weapon, and have perfected the art of rapidly switching forms mid-combat. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"After taking the Attack action to make a melee weapon attack against a creature, you can use a bonus action to use your Shard of Almorphius feature, instead of the normally required action. Once you use this feature, you cannot use it again until you finish a long rest.",
						"You have two Abyss points. When you hit with a melee weapon attack using a two-handed scythe, you can expend one Abyss point to activate an effect dependent on your current form:"
					]
				},
				{
					"type": "inset",
					"name": "",
					"entries": [{
							"entries": [
								"{@b Humane.} The target creature must make a Dexterity saving throw. On a failed save, you rend their limbs out from under them, reducing their movement speed to 0 until the end of their next turn."
							],
							"type": "entries"
						},
						{
							"entries": [
								"{@b Abyss.} The target creature must make a Strength saving throw. On a failed save, you slam your scythe down onto the floor, causing the ground to tremble underneath them. That creature is knocked {@condition prone}."
							],
							"type": "entries"
						}
					],
					"data": {
						"overwrite": "Darkvision"
					}
				},
				{
					"type": "list",
					"items": [
						"Your DC for these abilities are 8 + your proficiency bonus + your Charisma modifier. You regain all expended Abyss points on a long rest."
					]
				}
			]
		},
		{
			"name": "Hoplite of the Gods",
			"source": "WB: RD",
			"prerequisite": [{
				"other": "Proficiency in spears or javelins"
			}],
			"entries": [
				"You have trained in the art of Imperial combat, utilizing elongated weapons such as spears and javelins as long-range arcing projectiles to score hits against unsuspecting targets whose armor may otherwise defend against arrows of shorter stature. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"Non-magical spears and javelins you throw are treated as magical for the purposes of overcoming resistance and immunity.",
						"You can draw and holster a spear or javelin once per turn without expending an object interaction.",
						"Attacking at long range doesn't impose disadvantage on your thrown weapon attack rolls with spears or javelins.",
						"Your thrown weapon attacks with spears or javelins ignore half cover and three-quarters cover."
					]
				},
				{
					"type": "inset",
					"name": "",
					"entries": [{
							"entries": [
								"{@b Grandcrest Horizon.} You can forgo one of your attacks as part of your Attack action in order to perform an aerial barrage. Target a 30-foot radius within 120 feet of you. You chuck twelve spears or javelins into the sky at rapid speed—transforming the horizon into an impeding doomsday filled with the upturned gazes of jagged vehicles of demise.",
								"All creatures within the radius must make a Dexterity saving throw with a DC equal to 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice). On a failed save, that creature takes {@dice 6d4} piercing damage, or half as much damage on a successful save.",
								"Regardless of whether a creature passes or fails the saving throw, your polearms slam into the ground with tumultuous force, causing dirt and stone to rupture and crack with the intensity of a god's divine blow. The radius becomes difficult terrain until the area is cleared of weapons and debris, which takes one minute.",
								"Once you use this feature supplied by the feat, you cannot use it again until you finish a short or long rest."
							],
							"type": "entries"
						}
					],
					"data": {
						"overwrite": "Grandcrest"
					}
				}
			]
		},
		{
			"name": "Wrought From the Beneath",
			"source": "WB: RD",
			"prerequisite": [{
				"race": [{
					"name": "The Beneath"
				}]
			}],
			"entries": [
				"You were often called a pangolin. A creature who exists as a needless predator who rolls across the ground in abject confusion. In defiance, you decided to prove them wrong. Through the blood that runs through your veins, a distinct bloodline that siphons back to the ancient duergar, you became large. Exceedingly large. You gain the following benefits:",
				{
					"type": "list",
					"items": [
						"As an action, you become a Huge size creature. As you grow, your proportions increase by a factor of 1.6 as you tower over the creatures in your vicinity. While in this state, you gain resistance to non-magical bludgeoning, piercing, and slashing damage. In addition, creatures behind you gain the benefits of three-quarters cover, and your reach increases by 5 feet. This form lasts for one minute, and afterward, you revert to your original form. Once you use this feature, you cannot use it again until you finish a long rest."
					]
				}
			]
		}
	]
}