{
	"raceFluff": [
		{
			"name": "Flameveil",
			"source": "WMC",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"Sequestered in the shadows of humanity, blending into the city landscape like a flickering candlelight. Many Flameveil aren't even native to the Material Plane. They hail from a world beyond-from the boundless vistas of the Elemental Plane of Fire. They are warriors, vanguards, footholds and soldiers. In exclusivity, they bring the word of their deity to lands unknown.",
								{
									"type": "entries",
									"name": "Just Like Humans",
									"entries": [
                                        "Just as humans once claimed to be diverse and atypical, the common Flameveil follows much of the same path. While Flameveil biology tends to aspire to shades of yellow and red (in regards to physical appearance such as hair color), the notes are so obscure that they blend into human populations effortlessly. Only when a Flameveil shows of their incredible control of flames is their cover blown."
									]
								},
								{
									"type": "entries",
									"name": "A World Existing Solely of Flame",
									"entries": [
										"Most Flameveil live on the Elemental Plane of Fire. Flameveil can be drawn into the Material Plane, sometimes to pursue enemies or thwart their foes' designs there. Accident might also send a troop of Flameveil tumbling into a world on that plane, generally during an expedition or venture out to explore their ravaged homeworld. A few find their way to such a world through portals on their own plane and inseminate themsevles into human population, dilluting the strength of their flame magic over the course of several generations.",
										"Beyond that, Flameveil have little to no instinctual differences from that of humans (besides their inclination towards the lawful side of the world). Because of this, its easy to point toward the history of humanity and draw a direct line to the arrival of Flameveil in the Material Plane."
									]
								},
								{
									"type": "inset",
									"name": "Helknight, the Greater Deity of Fire",
									"entries": [
                                        "Helknight is symbolized by the holy symbol of a twining red flame and his portfolio covered elemental fire and purification through fire. Originally, the existence of Helknight was propeteered by the elves (knowledgable masters of the unseen worlds) as an elemental primordial whose power rivaled that of a True Deity. Over time, though, the appearance of the Flameveil in the Material Plane cemented him as a Greater Deity through Belief to Law.",
                                        "Although Flameveil revere Helknight, they do not exclusively worship him (or parade religion as most humans tend to do). Instead, worshippers of Helknight tend to be exclusively found in the Church of Empirical Flame. The church itself is rather hierarchical and mostly impersonal, with their beliefs revolving around the acquisition of land, power and wealth."
									]
								},
								{
									"type": "entries",
									"name": "Flameveil Names",
									"entries": [
										"Flameveil tend to renounce the names given to them in the Elemental Plane of Fire after arriving in the Material Plane, adopting a more humanity-friendly equivalent. In the rare cases a Flameveil chooses to keep their true name, however, their names tend to have a flickering intonation. Like the sound of a candlelight.",
                                        "A Flameveil of either gender may have one of these short names: Aroshe, Sarsa, Erosh, Vestet, Monak, Clique."
									]
								}
							]
						}
					]
				}
			],
			"images": [
				{
					"type": "image",
					"href": {
						"type": "internal",
						"path": "races/SRP/Flameveil.png"
					}
				}
			]
		},
		{
			"name": "Aarakocra (Revised)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			],
			"images": [
				{
					"type": "image",
					"href": {
						"type": "internal",
						"path": "races/Aarakocra.png"
					}
				}
			]
		},
		{
			"name": "Aasimar (Revised)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Centaur",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Changeling (Revised)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Human (No Variant, Revised)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Kobold (Revised)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Minotaur",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Minotaur (Kothas)",
			"source": "WBR",
			"_copy": {
				"name": "Minotaur",
				"source": "WBR",
				"_mod": {
					"entries": {
						"mode": "prependArr",
						"items": {
							"type": "section",
							"entries": [
								{
									"type": "entries",
									"entries": [
										"This sub-race has no additional information."
									]
								}
							]
						}
					}
				}
			}
		},
		{
			"name": "Minotaur (Mithas)",
			"source": "WBR",
			"_copy": {
				"name": "Minotaur",
				"source": "WBR",
				"_mod": {
					"entries": {
						"mode": "prependArr",
						"items": {
							"type": "section",
							"entries": [
								{
									"type": "entries",
									"entries": [
										"This sub-race has no additional information."
									]
								}
							]
						}
					}
				}
			}
		},
		{
			"name": "Centaur",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Dragonborn (Chromatic)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Dragonborn (Gem)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Dragonborn (Metallic)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Orc (Revised)",
			"source": "WBR",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"This is a <b>World Boundary Revised</b> race, meaning that this original race was revised in the World Boundary West March to be more on-level with other allowed races. Depending on the type of game you're playing, the lore of this race may or may not be the same as vanilla Forgotten Realms."
							]
						}
					]
				}
			]
		},
		{
			"name": "Aftuan",
			"source": "WMC",
			"entries": [
				{
					"type": "entries",
					"entries": [
						{
							"type": "entries",
							"entries": [
								"<b>Aftuan</b>, despite their humanoid appearance, are classified under the Gazer family, giving them more similarities with a mindflayer and a beholder than a human. At first glance, an aftuan might not seem out of place—the proportions of their body appear the same as a human's, and there is little that can be done to see much else.",
								"Despite this, calling an aftuan &quot;human-like&quot; would be a misattribution, for the true nature of an aftuan is the antithesis of reality. Born from the silent nothingness, an aftuan is forged from anthroity's fear of the unknown. Eventually, they merge those emotions to forge an outer shell comprising of their physical form and enter our reality.",
								"Why an aftuan appears human on the offset is not an aesthetic choice, and serves two primary functions: to allow an aftuan to integrate into society, wherein they can feed upon negative emotions, and to act as a conduit so they can experience and store said fear.",
								"Although with that said, an aftuan could easily harness fear to perpetuate their existence as an otherworldly body (such as their true form), but they would feel significantly less pleasure from it, so it would not be a lie to claim that while functional in nature, the decision was purely one made out of selfishness.",
								"As years dragged on, this selfish pursuit of pleasure eventually became engrained into their evolutionary traits. The world would remember aftuan was human-posers, and soon, their integration into human society became self-evident.",
								{
									"type": "inset",
									"name": "Feeding Upon Fear",
									"entries": [
											"While aftuan feed on fear, their nature predisposes them to neutrality. While there are some human kingdoms who attempt to hunt them down, the purpose is more religious than practical. Human societys are inherently filled with negativity, which puts any aftuan who resides in a large city in a very cozy spot. There is little reason for them to commit crimes or acts of violence in order to feed."
									]
								},
								{
									"type": "entries",
									"name": "Immortal Aberrations",
									"entries": [
											"An aftuan's lifespan is only limited by their diet, and due to the ease at which they gain their nutrition, aftuan are virtually immortal. The only way for an aftuan to die is to either be killed in battle (due to their immunity to sickness), or to perish at the End of the World, when all other lifeforms are dead and gone forever."
									]
								},
								{
									"type": "entries",
									"name": "True Forms",
									"entries": [
											"Depending on an aftuan's nature, they may showcase some of their more abberant traits publicly (such as tentacles which whirl around their feed or heads that share aesthetic similarities to mindflayers), which may be done to signifiy their differences in cultures and kingdoms comprising entirely of monsters. In human civilizations, however, their tendency is towards that of being indistinguishably human. Naturally, they can transition from their human persona to their true form at will, but they receive no mechanical benefits for doing so."
									]
								}
							]
						}
					]
				}
			]
		}
	],
	"meta": {
		"uncommon": {
			"name": "Uncommon Races",
			"type": "inset",
			"entries": [
				"This race, and those listed below, are uncommon. They don't exist in every world of D&D, and even where they are found, they are less widespread than dwarves, elves, halflings, and humans. In the cosmopolitan cities of the D&D multiverse, most people hardly look twice at members of even the most exotic races. But the small towns and villages that dot the countryside are different. The common folk aren't accustomed to seeing members of these races, and they react accordingly.",
				{
					"type": "entries",
					"name": "Dragonborn",
					"entries": [
						"It's easy to assume that a dragonborn is a monster, especially if his or her scales betray a chromatic heritage. Unless the dragonborn starts breathing fire and causing destruction, though, people are likely to respond with caution rather than outright fear."
					]
				},
				{
					"type": "entries",
					"name": "Gnome",
					"entries": [
						"Gnomes don't look like a threat and can quickly disarm suspicion with good humor. The common folk are often curious about gnomes, likely never having seen one before, but they are rarely hostile or fearful."
					]
				},
				{
					"type": "entries",
					"name": "Half-Elf",
					"entries": [
						"Although many people have never seen a half-elf, virtually everyone knows they exist. A half-elf stranger's arrival is followed by gossip behind the half-elf's back and stolen glances across the common room, rather than any confrontation or open curiosity."
					]
				},
				{
					"type": "entries",
					"name": "Half-Orc",
					"entries": [
						"It's usually safe to assume that a half-orc is belligerent and quick to anger, so people watch themselves around an unfamiliar half-orc. Shopkeepers might surreptitiously hide valuable or fragile goods when a half-orc comes in, and people slowly clear out of a tavern, assuming a fight will break out soon."
					]
				},
				{
					"type": "entries",
					"name": "Tiefling",
					"entries": [
						"Half-orcs are greeted with a practical caution, but tieflings are the subject of supernatural fear. The evil of their heritage is plainly visible in their features, and as far as most people are concerned, a tiefling could very well be a devil straight from the Nine Hells. People might make warding signs as a tiefling approaches, cross the street to avoid passing near, or bar shop doors before a tiefling can enter."
					]
				}
			]
		},
		"monstrous": {
			"name": "Monstrous Adventurers",
			"type": "section",
			"entries": [
				"In some campaigns, humanoids normally regarded as sinister threats can emerge to adventure alongside humans and the other standard races. This section is aimed at DMs who wish to expand the race selections for their campaigns beyond the typical folk of D&D.",
				{
					"type": "entries",
					"name": "Why a Monstrous Character?",
					"entries": [
						"Creating characters as creatures normally cast as villains offers up some interesting roleplaying possibilities. Whether played for comedy, as a tragic story of betrayal and loss, or as an antihero, a monstrous character gives a player a chance to take on an unusual challenge in the campaign. Before allowing monstrous characters in your campaign, consider the following three questions."
					]
				},
				{
					"type": "entries",
					"name": "Rare or Mundane?",
					"entries": [
						"Consider how common orc, goblin, and similar adventurers are in your setting. Are they regarded as no stranger than elves or dwarves? Are they met with suspicion? The role these races play in your setting should determine the kinds of reactions that such characters meet.",
						"Don't be afraid to push things to an extreme. An orc character might have to venture into town in disguise or remain in the wilderness, for fear of imprisonment or mob violence. Be sure to talk to the group about how such characters can expect the world to treat them. Some players like the challenge of taking on an outcast, but don't set up one expectation and deliver another.",
						"You can establish a monstrous creature as just another culture in your campaign, one that has alliances and rivalries with humans, elves, and dwarves. A hobgoblin kingdom might serve as a buffer between a human kingdom and a blighted region overrun by the spawn of Kyuss. Kobolds might be city builders, the architects of grand, heavily fortified edifices, which other folk dwell in for a price. The cultural notes in chapter 1 are the standard D&D depiction of these creatures, but by no means do they define them for your campaign. Use them as a starting point for your own ideas."
					]
				},
				{
					"type": "entries",
					"name": "Outcast or Ambassador?",
					"entries": [
						"Consider how a monstrous character's native culture views the character. Is the character an outcast, a spy, an ambassador, or something else? Work with the player to determine how the character ended up as an adventurer.",
						"The character's bond is a great starting point to consider for this question. How did the bond drive the character to adventure? The character's trait, flaw, and ideal can also play a role in fleshing out the story."
					]
				},
				{
					"type": "entries",
					"name": "Friends or Enemies?",
					"entries": [
						"Figure out what special ties the character has to other members of the adventuring party. An orc warlock might be the dwarf ranger's sworn enemy, but the two are forced to work together to defeat a mutual foe. Perhaps the kobold sorcerer was the tiefling wizard's familiar, transformed by an irate archmage in return for some petty insult. The hobgoblin paladin might have been human once, but crossed the wrong hag and was cursed to take on an evil guise. A creative tie between a monstrous character and the rest of the party helps make for a memorable campaign.",
						"The Monstrous Origin table gives a number of ideas for adding a monstrous character to the campaign.",
						{
							"type": "table",
							"colLabels": [
								"d8",
								"Origin"
							],
							"colStyles": [
								"col-2 text-center",
								"col-10"
							],
							"rows": [
								[
									"1",
									"You are a spy sent to undermine your enemies from within."
								],
								[
									"2",
									"You are the victim of a curse or polymorph spell."
								],
								[
									"3",
									"You were raised by humans, elves, or dwarves and have adopted their culture."
								],
								[
									"4",
									"At a young age, you adopted a human religion and now serve it faithfully."
								],
								[
									"5",
									"You received divine insight that sent you on your path, and occasionally receive new visions that guide you."
								],
								[
									"6",
									"Your sworn enemy is an ally of your people, forcing you to leave your tribe to gain vengeance."
								],
								[
									"7",
									"An evil entity corrupted your people's society."
								],
								[
									"8",
									"An injury or strange event caused you to lose all memory of your past, but occasional flashes of it return to you."
								]
							]
						}
					]
				}
			]
		}
	}
}
